Revit 2026 API

# IndexPoint Class

---

A point primitive consisting of one index.

SystemObject Autodesk.Revit.DB.DirectContext3DIndexPrimitive Autodesk.Revit.DB.DirectContext3DIndexPoint

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IndexPoint : IndexPrimitive
```
```vb
Public Class IndexPoint
	Inherits IndexPrimitive
```
```cpp
public ref class IndexPoint : public IndexPrimitive
```
```fsharp
type IndexPoint =
    class
        inherit IndexPrimitive
    end
```

The IndexPoint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IndexPoint | Constructs the point primitive. |

|  | Name | Description |
| --- | --- | --- |
|  | Index | The index of the point's vertex. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from IndexPrimitive) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from IndexPrimitive) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetSizeInShortInts | Gets the amount of storage that the primitive takes up in a buffer, measured in short integers. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.DirectContext3D Namespace